#----------------------------------------------------------------------
# Zenra - ルーティングと各種モデル、ビューの呼び出しを行うクラス
#----------------------------------------------------------------------

require 'sinatra/base'
require_relative 'models/manga'

class Zenra < Sinatra::Base

	# helpers - コントローラを補佐するメソッドを定義
	#---------------------------------------------------------------------
	helpers do
	end

	# before - 全てのURLにおいて初めに実行される
	#---------------------------------------------------------------------
	before do
	end

	# get '/' - トップページへのアクセス
	#---------------------------------------------------------------------
	get '/' do
    @thumbnails = Manga.thumbnails
		erb :index
	end

  # get '/detail/:id' - 詳細ページ
  #---------------------------------------------------------------------
  get '/detail/:id' do
    @page = Manga.page(params[:id] , 50)
    erb :detail
  end

end
